# Environment Set Up

In [1]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd
import numpy as np
import pandas_profiling
import matplotlib.pyplot as plt
import seaborn as sns
import csv

from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, classification_report
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score
from sklearn.tree import plot_tree
from sklearn.preprocessing import LabelEncoder

%matplotlib inline

In [2]:
# Create a connection
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'

In [3]:
# Connect to the MySQL instance
db_connection = create_engine(db_connection_str)

In [4]:
# Query the Credit One data to extract it into a Pandas dataframe
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [5]:
# Export the dataframe to an excel .csv file for easy access
df.to_csv('Credit_One_Data_Raw.csv')

# Data Cleaning

In [6]:
df.head()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [7]:
df.shape

(30204, 25)

In [8]:
df.describe()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
count,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204,...,30204,30204,30204,30204,30204,30204,30204,30204,30204,30204
unique,30002,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,ID,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,2,3397,18217,14107,16088,1619,14828,15830,15863,16566,...,3218,3530,4045,5287,5437,6007,6450,6744,7233,23519

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30204 entries, 0 to 30203
Data columns (total 25 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   MyUnknownColumn  30204 non-null  object
 1   X1               30204 non-null  object
 2   X2               30204 non-null  object
 3   X3               30204 non-null  object
 4   X4               30204 non-null  object
 5   X5               30204 non-null  object
 6   X6               30204 non-null  object
 7   X7               30204 non-null  object
 8   X8               30204 non-null  object
 9   X9               30204 non-null  object
 10  X10              30204 non-null  object
 11  X11              30204 non-null  object
 12  X12              30204 non-null  object
 13  X13              30204 non-null  object
 14  X14              30204 non-null  object
 15  X15              30204 non-null  object
 16  X16              30204 non-null  object
 17  X17              30204 non-null  object
 18  X18              30204 non-null  object
 19  X19              30204 non-null  object
 20  X20              30204 non-null  object
 21  X21              30204 non-null  object
 22  X22              30204 non-null  object
 23  X23              30204 non-null  object
 24  Y                30204 non-null  object
dtypes: object(25)
memory usage: 5.8+ MB

In [10]:
# Delete duplicate entries
df = df.drop_duplicates()
df.describe()

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
count,30002,30002,30002,30002,30002,30002,30002,30002,30002,30002,...,30002,30002,30002,30002,30002,30002,30002,30002,30002,30002
unique,30002,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,ID,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,1,3365,18112,14030,15964,1605,14737,15730,15764,16455,...,3195,3506,4020,5249,5396,5968,6408,6703,7173,23364

In [11]:
# Check for missing values
df.isnull().sum()

MyUnknownColumn    0
X1                 0
X2                 0
X3                 0
X4                 0
X5                 0
X6                 0
X7                 0
X8                 0
X9                 0
X10                0
X11                0
X12                0
X13                0
X14                0
X15                0
X16                0
X17                0
X18                0
X19                0
X20                0
X21                0
X22                0
X23                0
Y                  0
dtype: int64

In [12]:
# Reset first row to be header names
df.columns = df.iloc[0]
df = df.iloc[1:].reset_index(drop=True)
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
1,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [13]:
df.shape

(30001, 25)

In [14]:
# Set ID as index
df.set_index('ID', inplace=True)
df.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
ID,,,,,,,,,,,,,,,,,,,,,
1,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
2,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
5,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [15]:
# Reset index as untitled column
df.reset_index(drop=True, inplace=True)
df

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
1,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29996,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
29997,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
29998,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
29999,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30000,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [16]:
# Duplicate header in row 201
df.iloc[201]

0
LIMIT_BAL                      X1
SEX                            X2
EDUCATION                      X3
MARRIAGE                       X4
AGE                            X5
PAY_0                          X6
PAY_2                          X7
PAY_3                          X8
PAY_4                          X9
PAY_5                         X10
PAY_6                         X11
BILL_AMT1                     X12
BILL_AMT2                     X13
BILL_AMT3                     X14
BILL_AMT4                     X15
BILL_AMT5                     X16
BILL_AMT6                     X17
PAY_AMT1                      X18
PAY_AMT2                      X19
PAY_AMT3                      X20
PAY_AMT4                      X21
PAY_AMT5                      X22
PAY_AMT6                      X23
default payment next month      Y
Name: 201, dtype: object

In [17]:
# Remove duplicate header
df.drop([201], axis=0, inplace=True)

In [18]:
df.shape

(30000, 24)

In [19]:
df.tail()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
29996,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
29997,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
29998,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
29999,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
30000,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [20]:
# Reset index to reset values
df.reset_index(drop=True, inplace=True)
df.tail()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
29995,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
29996,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
29997,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
29998,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
29999,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [21]:
# Checking values of string objects to convert to numerical values
df['SEX'].value_counts()

female    18112
male      11888
Name: SEX, dtype: int64

In [22]:
df['EDUCATION'].value_counts()

university         14030
graduate school    10585
high school         4917
other                468
Name: EDUCATION, dtype: int64

In [23]:
df['MARRIAGE'].value_counts()

2    15964
1    13659
3      323
0       54
Name: MARRIAGE, dtype: int64

In [24]:
df['default payment next month'].value_counts()

not default    23364
default         6636
Name: default payment next month, dtype: int64

In [25]:
header = df.dtypes.index
print(header)

Index(['LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_0', 'PAY_2',
       'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object', name=0)

In [26]:
# Save clean data file for easy access at a later date
df.to_csv('Credit_One_Data_No_Dups.csv')

In [27]:
# Create copy of dataframe for converting datatypes and renaming columns.
data = df.copy()

In [28]:
# Rename columns for legibility
data.set_axis(['Credit Balance', 'Sex', 'Education Level', 'Marital Status', 'Age', 'Dlq Sep', 
               'Dlq Aug', 'Dlq Jul', 'Dlq Jun', 'Dlq May', 'Dlq Apr', 'Bill Sep', 'Bill Aug',
              'Bill Jul', 'Bill Jun', 'Bill May', 'Bill Apr', 'Paid Sep', 'Paid Aug', 'Paid Jul',
              'Paid Jun', 'Paid May', 'Paid Apr', 'Default?'], axis=1, inplace=True)
data

,Credit Balance,Sex,Education Level,Marital Status,Age,Dlq Sep,Dlq Aug,Dlq Jul,Dlq Jun,Dlq May,...,Bill Jun,Bill May,Bill Apr,Paid Sep,Paid Aug,Paid Jul,Paid Jun,Paid May,Paid Apr,Default?
0,20000,female,university,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,default
1,120000,female,university,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,90000,female,university,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,50000,female,university,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,50000,male,university,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,220000,male,high school,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,not default
29996,150000,male,high school,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,not default
29997,30000,male,university,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,default
29998,80000,male,high school,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,default
29999,50000,male,university,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,default

In [29]:
# Convert 'Sex' values to numeric. Original documentation uses 1 and 2.
data['Sex'].mask(data['Sex'] == 'male', 1, inplace=True)
data['Sex'].mask(data['Sex'] == 'female', 2, inplace=True)

In [30]:
# Convert 'Education Level' values to numeric
data['Education Level'].mask(data['Education Level'] == 'graduate school', 1, inplace=True)
data['Education Level'].mask(data['Education Level'] == 'university', 2, inplace=True)
data['Education Level'].mask(data['Education Level'] == 'high school', 3, inplace=True)
data['Education Level'].mask(data['Education Level'] == 'other', 4, inplace=True)

In [31]:
# Convert 'Default?' values to numeric (binary)
data['Default?'].mask(data['Default?'] == 'not default', 0, inplace=True)
data['Default?'].mask(data['Default?'] == 'default', 1, inplace=True)

In [32]:
data

,Credit Balance,Sex,Education Level,Marital Status,Age,Dlq Sep,Dlq Aug,Dlq Jul,Dlq Jun,Dlq May,...,Bill Jun,Bill May,Bill Apr,Paid Sep,Paid Aug,Paid Jul,Paid Jun,Paid May,Paid Apr,Default?
0,20000,2,2,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,1
1,120000,2,2,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,90000,2,2,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,50000,2,2,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,50000,1,2,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,220000,1,3,1,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,0
29996,150000,1,3,2,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,0
29997,30000,1,2,2,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,1
29998,80000,1,3,1,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,1
29999,50000,1,2,1,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,1

In [33]:
data.dtypes

Credit Balance     object
Sex                object
Education Level    object
Marital Status     object
Age                object
Dlq Sep            object
Dlq Aug            object
Dlq Jul            object
Dlq Jun            object
Dlq May            object
Dlq Apr            object
Bill Sep           object
Bill Aug           object
Bill Jul           object
Bill Jun           object
Bill May           object
Bill Apr           object
Paid Sep           object
Paid Aug           object
Paid Jul           object
Paid Jun           object
Paid May           object
Paid Apr           object
Default?           object
dtype: object

In [34]:
# Convert columns to numeric data types
data = data.apply(pd.to_numeric)

data.dtypes

Credit Balance     int64
Sex                int64
Education Level    int64
Marital Status     int64
Age                int64
Dlq Sep            int64
Dlq Aug            int64
Dlq Jul            int64
Dlq Jun            int64
Dlq May            int64
Dlq Apr            int64
Bill Sep           int64
Bill Aug           int64
Bill Jul           int64
Bill Jun           int64
Bill May           int64
Bill Apr           int64
Paid Sep           int64
Paid Aug           int64
Paid Jul           int64
Paid Jun           int64
Paid May           int64
Paid Apr           int64
Default?           int64
dtype: object

In [35]:
# Convert columns displaying dollar amounts to float type
data['Credit Balance'] = data['Credit Balance'].astype(float)
data['Bill Sep'] = data['Bill Sep'].astype(float)
data['Bill Aug'] = data['Bill Aug'].astype(float)
data['Bill Jul'] = data['Bill Jul'].astype(float)
data['Bill Jun'] = data['Bill Jun'].astype(float)
data['Bill May'] = data['Bill May'].astype(float)
data['Bill Apr'] = data['Bill Apr'].astype(float)
data['Paid Sep'] = data['Paid Sep'].astype(float)
data['Paid Aug'] = data['Paid Aug'].astype(float)
data['Paid Jul'] = data['Paid Jul'].astype(float)
data['Paid Jun'] = data['Paid Jun'].astype(float)
data['Paid May'] = data['Paid May'].astype(float)
data['Paid Apr'] = data['Paid Apr'].astype(float)

# Display decimals to two places
pd.options.display.float_format = '{:,.2f}'.format

data.head()

,Credit Balance,Sex,Education Level,Marital Status,Age,Dlq Sep,Dlq Aug,Dlq Jul,Dlq Jun,Dlq May,...,Bill Jun,Bill May,Bill Apr,Paid Sep,Paid Aug,Paid Jul,Paid Jun,Paid May,Paid Apr,Default?
0,"20,000.00",2,2,1,24,2,2,-1,-1,-2,...,0.00,0.00,0.00,0.00,689.00,0.00,0.00,0.00,0.00,1
1,"120,000.00",2,2,2,26,-1,2,0,0,0,...,"3,272.00","3,455.00","3,261.00",0.00,"1,000.00","1,000.00","1,000.00",0.00,"2,000.00",1
2,"90,000.00",2,2,2,34,0,0,0,0,0,...,"14,331.00","14,948.00","15,549.00","1,518.00","1,500.00","1,000.00","1,000.00","1,000.00","5,000.00",0
3,"50,000.00",2,2,1,37,0,0,0,0,0,...,"28,314.00","28,959.00","29,547.00","2,000.00","2,019.00","1,200.00","1,100.00","1,069.00","1,000.00",0
4,"50,000.00",1,2,1,57,-1,0,-1,0,0,...,"20,940.00","19,146.00","19,131.00","2,000.00","36,681.00","10,000.00","9,000.00",689.00,679.00,0

In [36]:
data.dtypes

Credit Balance     float64
Sex                  int64
Education Level      int64
Marital Status       int64
Age                  int64
Dlq Sep              int64
Dlq Aug              int64
Dlq Jul              int64
Dlq Jun              int64
Dlq May              int64
Dlq Apr              int64
Bill Sep           float64
Bill Aug           float64
Bill Jul           float64
Bill Jun           float64
Bill May           float64
Bill Apr           float64
Paid Sep           float64
Paid Aug           float64
Paid Jul           float64
Paid Jun           float64
Paid May           float64
Paid Apr           float64
Default?             int64
dtype: object

In [37]:
# Save clean data file for easy access at a later date
data.to_csv('Credit_One_Data_Clean.csv')

<b>Key for clean dataframe:</b>

<b>Sex:</b> 1 = male; 2 = female
        
<b>Education Level:</b> 1 = graduate school; 2 = university; 3 = high school; 4 = other

<b>Marital Status:</b> 1 = married; 2 = single; 3 = divorced; 4 = other

<b>Delinquency Status (Dlq):</b> -2 = no consumption; -1 = paid in full; 0 = revolving credit; 1-9 = payment delay for 1-9 mos.

<b>Default?:</b> 0 = not default; 1 = default

# Exploratory Data Analysis

In [38]:
# View correlation matrix
corr_mat = data.corr()
print(corr_mat)

                 Credit Balance   Sex  Education Level  Marital Status   Age  \
Credit Balance             1.00  0.02            -0.23           -0.11  0.14
Sex                        0.02  1.00             0.01           -0.03 -0.09
Education Level           -0.23  0.01             1.00           -0.15  0.18
Marital Status            -0.11 -0.03            -0.15            1.00 -0.41
Age                        0.14 -0.09             0.18           -0.41  1.00
Dlq Sep                   -0.27 -0.06             0.11            0.02 -0.04
Dlq Aug                   -0.30 -0.07             0.13            0.02 -0.05
Dlq Jul                   -0.29 -0.07             0.12            0.03 -0.05
Dlq Jun                   -0.27 -0.06             0.12            0.03 -0.05
Dlq May                   -0.25 -0.06             0.10            0.04 -0.05
Dlq Apr                   -0.24 -0.04             0.09            0.03 -0.05
Bill Sep                   0.29 -0.03             0.02           -0.02  0.06
Bill Aug                   0.28 -0.03             0.01           -0.02  0.05
Bill Jul                   0.28 -0.02             0.01           -0.02  0.05
Bill Jun                   0.29 -0.02            -0.01           -0.02  0.05
Bill May                   0.30 -0.02            -0.01           -0.03  0.05
Bill Apr                   0.29 -0.02            -0.01           -0.02  0.05
Paid Sep                   0.20 -0.00            -0.04           -0.01  0.03
Paid Aug                   0.18 -0.00            -0.03           -0.01  0.02
Paid Jul                   0.21 -0.01            -0.04           -0.00  0.03
Paid Jun                   0.20 -0.00            -0.04           -0.01  0.02
Paid May                   0.22 -0.00            -0.05           -0.00  0.02
Paid Apr                   0.22 -0.00            -0.04           -0.01  0.02
Default?                  -0.15 -0.04             0.03           -0.02  0.01

                 Dlq Sep  Dlq Aug  Dlq Jul  Dlq Jun  Dlq May  ...  Bill Jun  \
Credit Balance     -0.27    -0.30    -0.29    -0.27    -0.25  ...      0.29
Sex                -0.06    -0.07    -0.07    -0.06    -0.06  ...     -0.02
Education Level     0.11     0.13     0.12     0.12     0.10  ...     -0.01
Marital Status      0.02     0.02     0.03     0.03     0.04  ...     -0.02
Age                -0.04    -0.05    -0.05    -0.05    -0.05  ...      0.05
Dlq Sep             1.00     0.67     0.57     0.54     0.51  ...      0.18
Dlq Aug             0.67     1.00     0.77     0.66     0.62  ...      0.22
Dlq Jul             0.57     0.77     1.00     0.78     0.69  ...      0.23
Dlq Jun             0.54     0.66     0.78     1.00     0.82  ...      0.25
Dlq May             0.51     0.62     0.69     0.82     1.00  ...      0.27
Dlq Apr             0.47     0.58     0.63     0.72     0.82  ...      0.27
Bill Sep            0.19     0.23     0.21     0.20     0.21  ...      0.86
Bill Aug            0.19     0.24     0.24     0.23     0.23  ...      0.89
Bill Jul            0.18     0.22     0.23     0.24     0.24  ...      0.92
Bill Jun            0.18     0.22     0.23     0.25     0.27  ...      1.00
Bill May            0.18     0.22     0.23     0.24     0.27  ...      0.94
Bill Apr            0.18     0.22     0.22     0.24     0.26  ...      0.90
Paid Sep           -0.08    -0.08     0.00    -0.01    -0.01  ...      0.23
Paid Aug           -0.07    -0.06    -0.07    -0.00    -0.00  ...      0.21
Paid Jul           -0.07    -0.06    -0.05    -0.07     0.01  ...      0.30
Paid Jun           -0.06    -0.05    -0.05    -0.04    -0.06  ...      0.13
Paid May           -0.06    -0.04    -0.04    -0.03    -0.03  ...      0.16
Paid Apr           -0.06    -0.04    -0.04    -0.03    -0.02  ...      0.18
Default?            0.32     0.26     0.24     0.22     0.20  ...     -0.01

                 Bill May  Bill Apr  Paid Sep  Paid Aug  Paid Jul  Paid Jun  \
Credit Balance       0.30      0.29      0.20      0.18      0.21      0.20
Sex                 -0.02     -0.02     -0.00     -0.00     -0.01     -0.00
Education Level     -0.01     -0.01     -0.04     -0.03     -0.04     -0.04
Marital Status      -0.03     -0.02     -0.01     -0.01     -0.00     -0.01
Age                  0.05      0.05      0.03      0.02      0.03      0.02
Dlq Sep              0.18      0.18     -0.08     -0.07     -0.07     -0.06
Dlq Aug              0.22      0.22     -0.08     -0.06     -0.06     -0.05
Dlq Jul              0.23      0.22      0.00     -0.07     -0.05     -0.05
Dlq Jun              0.24      0.24     -0.01     -0.00     -0.07     -0.04
Dlq May              0.27      0.26     -0.01     -0.00      0.01     -0.06
Dlq Apr              0.29      0.29     -0.00     -0.01      0.01      0.02
Bill Sep             0.83      0.80      0.14      0.10      0.16      0.16
Bill Aug             0.86      0.83      0.28      0.10      0.15      0.15
Bill Jul             0.88      0.85      0.24      0.32      0.13      0.14
Bill Jun             0.94      0.90      0.23      0.21      0.30      0.13
Bill May             1.00      0.95      0.22      0.18      0.25      0.29
Bill Apr             0.95      1.00      0.20      0.17      0.23      0.25
Paid Sep             0.22      0.20      1.00      0.29      0.25      0.20
Paid Aug             0.18      0.17      0.29      1.00      0.24      0.18
Paid Jul             0.25      0.23      0.25      0.24      1.00      0.22
Paid Jun             0.29      0.25      0.20      0.18      0.22      1.00
Paid May             0.14      0.31      0.15      0.18      0.16      0.15
Paid Apr             0.16      0.12      0.19      0.16      0.16      0.16
Default?            -0.01     -0.01     -0.07     -0.06     -0.06     -0.06

                 Paid May  Paid Apr  Default?
Credit Balance       0.22      0.22     -0.15
Sex                 -0.00     -0.00     -0.04
Education Level     -0.05     -0.04      0.03
Marital Status      -0.00     -0.01     -0.02
Age                  0.02      0.02      0.01
Dlq Sep             -0.06     -0.06      0.32
Dlq Aug             -0.04     -0.04      0.26
Dlq Jul             -0.04     -0.04      0.24
Dlq Jun             -0.03     -0.03      0.22
Dlq May             -0.03     -0.02      0.20
Dlq Apr             -0.05     -0.03      0.19
Bill Sep             0.17      0.18     -0.02
Bill Aug             0.16      0.17     -0.01
Bill Jul             0.18      0.18     -0.01
Bill Jun             0.16      0.18     -0.01
Bill May             0.14      0.16     -0.01
Bill Apr             0.31      0.12     -0.01
Paid Sep             0.15      0.19     -0.07
Paid Aug             0.18      0.16     -0.06
Paid Jul             0.16      0.16     -0.06
Paid Jun             0.15      0.16     -0.06
Paid May             1.00      0.15     -0.06
Paid Apr             0.15      1.00     -0.05
Default?            -0.06     -0.05      1.00

[24 rows x 24 columns]

In [39]:
# Export correlation matrix to .csv file
corr_mat.to_csv('Credit One Correlation Matrix.csv')

<b>Strongest correlations are:</b>

Month to month bills (0.80-0.95) -- <i>higher bills one month tend to indicate higher bills across all months sample.</i>

Month to month deliquency (0.47-0.82) -- <i>delinquency in payments indicate a higher chance of a history of delinquent payments.</i>

Delinquency to default (0.19-0.32) -- <i>higher delinquency rates indicate a higher risk of default.</i>

Monthly bill to delinquency (0.18-0.29) -- <i>higher monthly bills indicate higher risk of delinquent payments.</i>

Age to default (-0.15) -- <i>slight inverse correlation between age and default risk.</i>

In [40]:
# View covariance matrix
cov_mat = data.cov()
print(cov_mat)

                   Credit Balance       Sex  Education Level  Marital Status  \
Credit Balance  16,834,455,682.16  1,571.05       -22,322.23       -7,323.67
Sex                      1,571.05      0.24             0.00           -0.01
Education Level        -22,322.23      0.00             0.55           -0.06
Marital Status          -7,323.67     -0.01            -0.06            0.27
Age                    173,076.72     -0.41             1.25           -1.99
Dlq Sep                -39,545.93     -0.03             0.09            0.01
Dlq Aug                -46,037.65     -0.04             0.12            0.02
Dlq Jul                -44,432.25     -0.04             0.11            0.02
Dlq Jun                -40,571.81     -0.03             0.10            0.02
Dlq May                -36,670.56     -0.03             0.09            0.02
Dlq Apr                -35,093.08     -0.02             0.08            0.02
Bill Sep         2,727,019,968.96 -1,211.69           909.89         -902.15
Bill Aug         2,570,130,193.14 -1,085.60           634.80         -802.52
Bill Jul         2,548,533,162.49   -833.21           346.64         -901.68
Bill Jun         2,453,925,762.41   -688.49          -293.64         -783.88
Bill May         2,331,481,075.23   -505.69          -563.01         -805.84
Bill Apr         2,243,837,219.05   -487.43          -560.71         -659.22
Paid Sep           419,571,137.19     -1.96          -506.67          -51.69
Paid Aug           533,350,408.97    -15.68          -562.52          -97.33
Paid Jul           480,117,965.23    -74.03          -580.61          -32.55
Paid Jun           413,120,195.84    -17.08          -477.60         -103.52
Paid May           430,565,688.99    -12.46          -513.43           -9.61
Paid Apr           506,515,298.30    -24.05          -583.16          -61.62
Default?                -8,267.55     -0.01             0.01           -0.01

                       Age    Dlq Sep    Dlq Aug    Dlq Jul    Dlq Jun  \
Credit Balance  173,076.72 -39,545.93 -46,037.65 -44,432.25 -40,571.81
Sex                  -0.41      -0.03      -0.04      -0.04      -0.03
Education Level       1.25       0.09       0.12       0.11       0.10
Marital Status       -1.99       0.01       0.02       0.02       0.02
Age                  84.97      -0.41      -0.55      -0.59      -0.54
Dlq Sep              -0.41       1.26       0.90       0.77       0.71
Dlq Aug              -0.55       0.90       1.43       1.10       0.93
Dlq Jul              -0.59       0.77       1.10       1.43       1.09
Dlq Jun              -0.54       0.71       0.93       1.09       1.37
Dlq May              -0.56       0.65       0.84       0.93       1.09
Dlq Apr              -0.52       0.61       0.79       0.87       0.96
Bill Sep         38,172.93  15,480.30  20,706.61  18,373.21  17,460.20
Bill Aug         35,613.66  15,185.92  20,045.83  20,214.07  18,790.63
Bill Jul         34,334.25  14,011.56  18,609.51  18,882.49  19,863.00
Bill Jun         30,453.11  12,950.25  17,116.30  17,494.10  18,496.42
Bill May         27,654.07  12,341.67  16,110.95  16,382.95  17,265.55
Bill Apr         26,137.65  11,844.76  15,642.88  15,847.09  16,651.59
Paid Sep          3,992.04  -1,475.50  -1,600.24      25.67    -181.30
Paid Aug          4,626.86  -1,815.14  -1,627.19  -1,841.95     -52.36
Paid Jul          4,746.82  -1,396.17  -1,178.33  -1,123.43  -1,425.21
Paid Jun          3,087.32  -1,126.85    -878.84    -863.76    -796.04
Paid May          3,218.05    -999.11    -678.47    -655.80    -599.99
Paid Apr          3,191.90  -1,172.19    -776.84    -763.03    -552.14
Default?              0.05       0.15       0.13       0.12       0.11

                   Dlq May  ...         Bill Jun         Bill May  \
Credit Balance  -36,670.56  ... 2,453,925,762.41 2,331,481,075.23
Sex                  -0.03  ...          -688.49          -505.69
Education Level       0.09  ...          -293.64          -563.01
Marital Status        0.02  ...          -783.88          -805.84
Age                  -0.56  ...        30,453.11        27,654.07
Dlq Sep               0.65  ...        12,950.25        12,341.67
Dlq Aug               0.84  ...        17,116.30        16,110.95
Dlq Jul               0.93  ...        17,494.10        16,382.95
Dlq Jun               1.09  ...        18,496.42        17,265.55
Dlq May               1.28  ...        19,822.93        18,586.59
Dlq Apr               1.06  ...        19,705.55        20,338.12
Bill Sep         17,246.38  ... 4,075,285,908.54 3,714,795,086.45
Bill Aug         18,301.29  ... 4,086,508,471.13 3,720,400,627.88
Bill Jul         19,122.66  ... 4,122,238,140.12 3,726,780,292.73
Bill Jun         19,822.93  ... 4,138,716,378.35 3,677,105,083.61
Bill May         18,586.59  ... 3,677,105,083.61 3,696,294,149.75
Bill Apr         17,715.69  ... 3,451,762,315.90 3,425,914,036.93
Paid Sep           -114.28  ...   248,288,839.00   218,550,112.41
Paid Aug            -83.32  ...   307,668,602.26   253,893,598.48
Paid Jul            180.81  ...   339,837,354.62   270,080,541.35
Paid Jun         -1,034.96  ...   131,213,254.24   279,183,011.81
Paid May           -577.16  ...   157,689,158.00   131,505,074.63
Paid Apr           -463.89  ...   203,159,015.64   177,453,731.89
Default?              0.10  ...          -271.20          -170.60

                        Bill Apr       Paid Sep       Paid Aug       Paid Jul  \
Credit Balance  2,243,837,219.05 419,571,137.19 533,350,408.97 480,117,965.23
Sex                      -487.43          -1.96         -15.68         -74.03
Education Level          -560.71        -506.67        -562.52        -580.61
Marital Status           -659.22         -51.69         -97.33         -32.55
Age                    26,137.65       3,992.04       4,626.86       4,746.82
Dlq Sep                11,844.76      -1,475.50      -1,815.14      -1,396.17
Dlq Aug                15,642.88      -1,600.24      -1,627.19      -1,178.33
Dlq Jul                15,847.09          25.67      -1,841.95      -1,123.43
Dlq Jun                16,651.59        -181.30         -52.36      -1,425.21
Dlq May                17,715.69        -114.28         -83.32         180.81
Dlq Apr                19,524.88         -28.50        -138.40         118.12
Bill Sep        3,519,876,286.88 171,089,378.38 168,569,162.25 203,404,764.92
Bill Aug        3,524,867,535.77 330,514,612.96 165,385,917.05 188,873,077.86
Bill Jul        3,524,246,854.84 280,656,488.31 506,422,568.51 158,747,812.13
Bill Jun        3,451,762,315.90 248,288,839.00 307,668,602.26 339,837,354.62
Bill May        3,425,914,036.93 218,550,112.41 253,893,598.48 270,080,541.35
Bill Apr        3,546,691,724.50 197,247,757.55 236,924,365.92 245,123,262.07
Paid Sep          197,247,757.55 274,342,256.09 108,984,873.27  73,546,259.50
Paid Aug          236,924,365.92 108,984,873.27 530,881,708.88  99,298,407.10
Paid Jul          245,123,262.07  73,546,259.50  99,298,407.10 310,005,092.20
Paid Jun          233,466,994.43  51,781,889.84  65,011,682.54  59,669,700.91
Paid May          279,998,165.08  37,568,934.94  63,684,135.03  42,829,213.50
Paid Apr          122,276,112.36  54,690,330.96  64,568,158.10  50,938,794.82
Default?                 -132.80        -501.37        -560.21        -411.08

                      Paid Jun       Paid May       Paid Apr  Default?
Credit Balance  413,120,195.84 430,565,688.99 506,515,298.30 -8,267.55
Sex                     -17.08         -12.46         -24.05     -0.01
Education Level        -477.60        -513.43        -583.16      0.01
Marital Status         -103.52          -9.61         -61.62     -0.01
Age                   3,087.32       3,218.05       3,191.90      0.05
Dlq Sep              -1,126.85        -999.11      -1,172.19      0.15
Dlq Aug                -878.84        -678.47        -776.84      0.13
Dlq Jul                -863.76        -655.80        -763.03      0.12
Dlq Jun                -796.04        -599.99        -552.14      0.11
Dlq May              -1,034.96        -577.16        -463.89      0.10
Dlq Apr                 342.62        -815.83        -517.22      0.09
Bill Sep        182,616,402.16 187,909,135.09 234,768,108.26   -600.39
Bill Aug        164,351,779.83 171,765,194.91 220,484,451.14   -419.29
Bill Jul        155,800,295.64 190,412,628.58 224,781,727.24   -405.15
Bill Jun        131,213,254.24 157,689,158.00 203,159,015.64   -271.20
Bill May        279,183,011.81 131,505,074.63 177,453,731.89   -170.60
Bill Apr        233,466,994.43 279,998,165.08 122,276,112.36   -132.80
Paid Sep         51,781,889.84  37,568,934.94  54,690,330.96   -501.37
Paid Aug         65,011,682.54  63,684,135.03  64,568,158.10   -560.21
Paid Jul         59,669,700.91  42,829,213.50  50,938,794.82   -411.08
Paid Jun        245,428,561.13  36,340,975.77  43,957,474.48   -369.52
Paid May         36,340,975.77 233,426,624.43  42,071,104.89   -349.56
Paid Apr         43,957,474.48  42,071,104.89 316,038,289.40   -392.43
Default?               -369.52        -349.56        -392.43      0.17

[24 rows x 24 columns]